Documents/ВозвратПоПлатежнойКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратПоПлатежнойКарте</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.КомплексныйРасчетКлиента</xr:Item>
				<xr:Item>Document.ОплатаПлатежнойКартой</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.Оплаты</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.омг_ОстаткиПредоплаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаЭТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдать</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомплексныйРасчетКлиента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресEmailЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприменениеККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераЧековСторно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьАдрес</Name>
					<Comment>Адрес покупателя (клиента) (Тег 1254) – для расчетов между организациями (ИП).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационныйРеквизит</Name>
					<Comment>Реквизит кассового чека - Тэг 1270</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуемыйТерминал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_НомерТранзакцииТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриПокупке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРасчетаЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>омг_ВидыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_СтатусыПредоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>омг_СтатусыПредоплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПринята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизведенВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратПоПлатежнойКарте/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем мТекущаяДатаДокумента Экспорт;

&НаКлиенте
Перем РаспределитьНоменклатуруПоРазнымСНО Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеСвойства = РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтотОбъект);
	
	НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Объект.Филиал, Истина, ОбщегоНазначенияБИТКлиентСервер.ЗаполненноеЗначение(Объект.ДатаПечатиЧека, Объект.Дата));
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьДепозитнуюОперациюККМ();
	КонецЕсли;
	
	ДоступныПолныеПрава = Пользователи.ЭтоПолноправныйПользователь();
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
			Объект.ЭквайринговыйТерминал = РаботаСТорговымОборудованием.ПолучитьЭквайринговыйТерминал(, Объект.Филиал);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			ОМГ_ПереЗаполнитьОрганизацию(); 
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПредоплату();
	
	ПоместитьРеквизитыККТИзХЗвРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не РаботаСДокументамиКлиент.ФормаДокументаПриОткрытии(ЭтотОбъект, ДополнительныеСвойства) Тогда
		ЭтотОбъект.Закрыть();
		Возврат;
	КонецЕсли;
	
	мТекущаяДатаДокумента = Объект.Дата;
	ОбновитьДоступностьЭлементов();
	
	Элементы.НадписьВалюта.Заголовок = глКраткоеНаименованиеОсновнойВалюты;
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	РаботаСДокументамиКлиент.ОбновитьВидимостьДоступностьСпособаРасчетаККМ(ЭтаФорма, Неопределено, Объект.СпособРасчетаЧекаККМ, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Неопределено, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ПлатежныйДокументПриОткрытииПроверкаНоменклатурыДоплатыНаНесколькоСНО(ЭтаФорма);

	КоррекцияПриИзменении("");
	
	Если Истина И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РаботаСДокументамиКлиент.ПлатежныйДокументПередЗаписьюНаФорме(ЭтотОбъект, Отказ, Объект, ПараметрыЗаписи, НастройкаПечатиЧеков)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьРеквизитыККТИзРеквизитовФормыВХЗ(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Ложь, ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСДокументамиКлиент.ПлатежныйДокументПослеЗаписиОбработкаНоменклатурыДоплатыНаНесколькоСНО(ЭтаФорма);
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Сделка")
		И ЗначениеЗаполнено(Объект["Сделка"])
	Тогда
		Оповестить("ИзменениеДанныхОплатыКомплексногоРасчета", Новый Структура("Сделка", Объект["Сделка"]), Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	ОповещениеОВыборе = Новый ОписаниеОповещения("Подключаемый_КнопкаФилиалПриНажатииЗавершение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма, , ОповещениеОВыборе);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатииЗавершение(Результат, ДополнительныеЗначения) Экспорт
	
	НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Объект.Филиал, Истина);
	ЗаполнитьДепозитнуюОперациюККМ();
	РаботаСДокументамиКлиент.ОбновитьВидимостьДоступностьСпособаРасчетаККМ(ЭтаФорма, Неопределено, Объект.СпособРасчетаЧекаККМ, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Неопределено, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.ПлатежныйДокументОбновитьЭквайрингПриСменеФилиала(Объект, Результат.ИсходныйФилиал); 
	
	Если Результат.ИсходныйФилиал <> Объект.Филиал Тогда
		ОМГ_ПереЗаполнитьОрганизацию(); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КредитныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСФормамиКлиент.ДокументПриИзмененииДаты(ЭтаФорма, мТекущаяДатаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Объект.Клиент, Объект.Выдать, Объект.ВыдатьИНН, Объект.ВыдатьАдрес);
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыйТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();		
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		ПараметрыВыбораЗначения = Новый Структура("РабочееМесто", РабочееМесто);
		ПараметрыВыбораЗначения.Вставить("Филиал", Объект.Филиал);
		ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.ФормаВыбора", ПараметрыВыбораЗначения, Элементы.ЭквайринговыйТерминал,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	Если ЗначениеЗаполнено(Объект.НомерЧекаЭТ) Тогда
		Элементы.ЭквайринговыйТерминал.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Чек(Команда)
	РаботаСДокументамиКлиент.ЧекДенежногоДокумента(ЭтаФорма);
КонецПроцедуры

#Область СлужебныеПроцедурыПечатиЧеков

&НаКлиенте
Процедура КомандаSMS(Команда)
	ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	Объект.ТелефонЧек = КонтактнаяИнформацияКлиент.ВыбратьСоздатьКИКлиента(Объект.Клиент, ТипКИ, Объект.Филиал);
КонецПроцедуры

&НаКлиенте
Процедура КомандаEmail(Команда)
	ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
	Объект.АдресEmailЧек = КонтактнаяИнформацияКлиент.ВыбратьСоздатьКИКлиента(Объект.Клиент, ТипКИ, Объект.Филиал);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СпособРасчетаЧекаККМПриИзменении(Элемент)
	Если Объект.СпособРасчетаЧекаККМ = ПредопределенноеЗначение("Перечисление.СпособыРасчетаЧекаККМ.Аванс") Тогда
		Объект.КредитныеДанные.Очистить();
	КонецЕсли;
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Неопределено, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплатуКредитныхДанныхККМ(Команда)
	РаботаСДокументамиКлиентСервер.РаспределитьОплатуКредитныхДанныхККМ(Объект.КредитныеДанные, Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиент.КредитныеДанныеНоменклатураПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеСуммаПриИзменении(Элемент)
	ТД = Элементы.КредитныеДанные.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		РаботаСДокументамиКлиент.ЗаполнитьСуммуПриПокупкеСтрокиТабЧасти(ТД);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСФормамиКлиент.УстановитьСписокДоступныхСтавокНДС(ДанныеВыбора, СтандартнаяОбработка, НастройкаПечатиЧеков, Объект.Филиал);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДепозитнуюОперациюККМ()
	РаботаСДокументамиСервер.ЗаполнитьДепозитнуюОперациюККМ(Объект, НастройкаПечатиЧеков);
КонецФункции

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ПредложитьПерезаполнитьКредитныеДанныеПоСделкеДокумента(Объект, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеПриИзменении(Элемент)
	РаботаСДокументамиКлиент.КредитныеДанныеПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ)
		И Не ЗначениеЗаполнено(Объект.НомерЧекаЭТ)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ОплатаПлатежнойКартой")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
	Тогда
		Ответ = Ждать ВопросАсинх(НСтр("ru='Заполнить документ по исходному платежу?'"), РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.Отмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ОбъектКопия = Объект;
			ЗаполнитьДокументПоОплатеОснованию(ОбъектКопия);
			КопироватьДанныеФормы(ОбъектКопия, Объект);
			ОбновитьПредоплату();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДокументПоОплатеОснованию(ЗаполняемыйОбъект)
	Об = ДанныеФормыВЗначение(ЗаполняемыйОбъект, Тип("ДокументОбъект.ВозвратПоПлатежнойКарте"));
	Документы.ВозвратПоПлатежнойКарте.ЗаполнитьВозвратПоОплатеПлатежнойКартой(Об);
	ЗначениеВДанныеФормы(Об, ЗаполняемыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПолучателя(Команда)
	РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Объект.Клиент, Объект.Выдать, Объект.ВыдатьИНН, Объект.ВыдатьАдрес, Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьВидимостьЭлементовКоррекции(ЭтаФорма, Объект.Коррекция);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРедактированиеРеквизитаККТ(НазваниеРеквизитаККТ)
	РаботаСДокументамиКлиент.ВыполнитьРедактированиеРеквизитаККТ(ЭтотОбъект, НазваниеРеквизитаККТ, Объект.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура НадписьОперационныйРеквизитНажатие(Элемент)
	ВыполнитьРедактированиеРеквизитаККТ("ОперационныйРеквизит");
КонецПроцедуры

&наСервере
Процедура ПоместитьРеквизитыККТИзХЗвРеквизитыФормы()
	ОУОбъект = РеквизитФормыВЗначение("Объект");
	ОперационныйРеквизит = ОУОбъект.ОперационныйРеквизит.Получить();
КонецПроцедуры

&наСервере
Процедура ЗаписатьРеквизитыККТИзРеквизитовФормыВХЗ(ОУОбъект)
	ОУОбъект.ОперационныйРеквизит = Новый ХранилищеЗначения(ОперационныйРеквизит);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияРеквизитаККТ(Результат, ПараметрыРеквизитаККТ) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат.Свойство("ДетальнаяИнформация") Тогда
			РаботаСДокументамиКлиент.СохранитьЗначениеРеквизитаККТВОбъекте(ЭтаФорма, Результат.ДетальнаяИнформация, ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ);
			Если ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ = "ПерсональныеДанныеПокупателя" Тогда
				Объект.Выдать = Результат.Клиент;
				Объект.ВыдатьИНН = Результат.ДетальнаяИнформация.ИНН;
				Объект.ВыдатьАдрес = Результат.Адрес;
			КонецЕсли;
		ИначеЕсли Результат.Свойство("Удалить") Тогда
			РаботаСДокументамиКлиент.ОчиститьЗначениеРеквизитаККТВОбъекте(ЭтаФорма, ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьПерсональныеДанныеПокупателяНажатие(Элемент)
	ВыполнитьРедактированиеРеквизитаККТ("ПерсональныеДанныеПокупателя");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НаУслуги", Истина);
		ПараметрыФормы.Вставить("НаОплату", Ложь);
		ПараметрыФормы.Вставить("СертификатыТолькоВладельца", Истина);
		ПараметрыФормы.Вставить("ВладелецСертификата", Объект.Клиент);
		ПараметрыФормы.Вставить("ПроданныеСертификаты", Истина);
		ПараметрыФормы.Вставить("Дата", Объект.Дата);
		Оповещение = Новый ОписаниеОповещения("ДобавитьСертификат_Завершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Сертификаты.Форма.ФормаСпискаРасширеннаяУпр",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Нельзя выбрать сертификат, т.к. не указан клиент!'"), 10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат_Завершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Сертификаты") Тогда
		СтруктураДанныхСертификата = ПолучитьСтруктуДанныхСтрокиСертификата(Результат);
		ЗаполнитьЗначенияСвойств(Объект.КредитныеДанные.Добавить(), СтруктураДанныхСертификата);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуДанныхСтрокиСертификата(Сертификат)
	Возврат Новый Структура("Номенклатура, Наименование", Сертификат.ВидСертификата.Номенклатура, Сертификат.ВидСертификата.Наименование);
КонецФункции

&НаКлиенте
Процедура омг_СделатьВозврат(Команда)
	
	Если Не Объект.омг_ВидОплаты = ПредопределенноеЗначение("Перечисление.омг_ВидыОплаты.Предоплата") Тогда
		
		ОписаниеОшибки = "";
		Если Объект.НомерЧекаККМ <> 0 Тогда
			ТекстСообщения = "";
			РаботаСДокументамиКлиент.ПредложитьПечатьКопииЧекаПоДокументу(Объект.Ссылка, УникальныйИдентификатор, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Омг_Подтверждение();
		
	иначе
		Омг_Подтверждение();
	КонецЕсли; 
	
КонецПроцедуры    

&НаКлиенте
Процедура Омг_Подтверждение()
	
	ВидОплаты = "Безналичными";	
	
	Оповещение = Новый ОписаниеОповещения("Омг_ПослеЗакрытияВопроса", ЭтотОбъект,ВидОплаты);	
	ПоказатьВопрос(Оповещение,
		"Сделать возврат?",
		РежимДиалогаВопрос.ДаНетОтмена,
		0,
		КодВозвратаДиалога.Да, 
		"К возврату " + Объект.СуммаДокумента + " тг."+ Символы.ПС+
		ВидОплаты +" " + Объект.СуммаДокумента +" тг."+ Символы.ПС+
		"ИТОГО "+ Объект.СуммаДокумента+" тг." 
	);     

КонецПроцедуры

&НаКлиенте
Процедура Омг_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда  
		
		Если Объект.Ссылка.Пустая() Тогда	
			Если Не Записать() Тогда
				ПоказатьПредупреждение(, "Не удалось записать документ возврата.", 10);
				Возврат;
			КонецЕсли;
		КонецЕсли;

		Если Объект.омг_ВидОплаты = ПредопределенноеЗначение("Перечисление.омг_ВидыОплаты.Предоплата") Тогда
			
			РезультатВозврата = ВыполнитьВозвратПредоплатыНаСервере(Объект.ДокументОснование, Объект);
			
			Если РезультатВозврата.Успех Тогда
				ОбновитьПредоплату(); 
				Оповестить("ЗаявкаИзменена",Объект.ДокументОснование,Объект.Ссылка);
				ПоказатьПредупреждение(, "Возврат передан в обработку.", 5);
			Иначе
				ПоказатьПредупреждение(, "Не удалось выполнить возврат: " + РезультатВозврата.ТекстОшибки, 15);
			КонецЕсли;
			
		иначе
			
			ДанныеТерминалаИнтеграция = омг_WebKassa.омг_ПолучитьIPАдресТерминала(Объект.ЭквайринговыйТерминал);
			
			Если Объект.СуммаДокумента > 0 И Не ДанныеТерминалаИнтеграция.АдресТерминала = "" И ДанныеТерминалаИнтеграция.ИнтеграцияОплатаНаТерминал Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ДанныеТерминалаИнтеграция", ДанныеТерминалаИнтеграция); 
				ПараметрыФормы.Вставить("Сумма", Объект.СуммаДокумента);
				ПараметрыФормы.Вставить("ВидОперации",  "Возврат");
				ПараметрыФормы.Вставить("НомерТранзакцииТерминала", Объект.омг_НомерТранзакцииТерминала);
				
				Объект.омг_ИспользуемыйТерминал = ДанныеТерминалаИнтеграция.ИспользуемыйТерминал;
				Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Документ", ЭтаФорма);
				ДополнительныеПараметры.Вставить("ПодключаемоеОборудование", ДанныеТерминалаИнтеграция.ПодключаемоеОборудование);
				ДополнительныеПараметры.Вставить("ВидОплаты", Параметры);
				
				ОбработчикОповещения = Новый ОписаниеОповещения("омг_ВыполнитьИзменениеСостоянияПослеОплаты", ЭтотОбъект, ДополнительныеПараметры);
				
				ОткрытьФорму("ОбщаяФорма.омг_ОжиданиеОтветаТерминала", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
				Возврат;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры         

// Обертка серверного вызова омг_СделатьВозвратПредоплаты, возвращающая
// структуру результата на клиент.
&НаСервереБезКонтекста
Функция ВыполнитьВозвратПредоплатыНаСервере(Знач ДокументОснование, Знач ЗначенияФормы)
	
	ОбъектВозврата = ДанныеФормыВЗначение(ЗначенияФормы, Тип("ДокументОбъект.ВозвратПоПлатежнойКарте"));
	Возврат омг_Предоплата.омг_СделатьВозвратПредоплаты(ДокументОснование, ОбъектВозврата);
	
КонецФункции

&НаКлиенте
Процедура омг_ВыполнитьИзменениеСостоянияПослеОплаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено И Не ВРЕГ(Результат) = "НЕТ" Тогда
		
		Если Не ВРЕГ(Результат) = "ДА" Тогда
			Объект.НомерЧекаЭТ = Результат;
			Объект.омг_НомерТранзакцииТерминала = Результат;
		КонецЕсли;
		
		Попытка 
			Записать()
		Исключение  
			// ИСПРАВЛЕНО: логируем ошибку записи через серверную процедуру -
			// ЗаписьЖурналаРегистрации недоступна в клиентском контексте.
			ТекстОшибкиЗаписи = ОписаниеОшибки();
			омг_ЗафиксироватьОшибкуЗаписи("ВозвратПоПлатежнойКарте.омг_ВыполнитьИзменениеСостоянияПослеОплаты", ТекстОшибкиЗаписи);
			ПоказатьПредупреждение(, "Не удалось записать документ после возврата на терминале: " + ТекстОшибкиЗаписи, 15);
			Возврат;
		КонецПопытки;
		
		Если Не ВРЕГ(Результат) = "НЕТ" или Объект.НомерЧекаККМ = 0 Тогда
			НапечататьЧек(Истина); 
		КонецЕсли;  
	
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Процедура омг_ЗафиксироватьОшибкуЗаписи(Знач ИмяСобытия, Знач ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧек(Пробить=Ложь)
	
	ОчиститьСообщения();
	ОписаниеОшибки = "";
	
	Если Объект.НомерЧекаККМ <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;
	КонецЕсли;
			
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда 
		Контекст = Новый Структура(); 			
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение",ЭтотОбъект,Контекст);
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");			
		МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"),Пробить);
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры       
	
&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
	ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
	
	Если ТипУстройства = "ККТ" Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор , ИдентификаторУстройства, Ложь);
	Иначе
		ПолучитьПараметрыЗавершение(Неопределено, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, Параметры,Пробить=Ложь) Экспорт
	
	ОписаниеОшибки = "";
	Если ПараметрыФискальногоУстройства = Неопределено Тогда
		ВерсияФормата = "1.1.0.0";
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		ВерсияФормата = омг_WebKassa.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Параметры.ИдентификаторУстройства);
		НомерСекции = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		МассивЧеков = ПодготовитьДанныеДляПробитияЧека(НомерСекции, ВерсияФормата, ОписаниеОшибки);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание:
		|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли МассивЧеков.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Объект.НомерЧекаЭТ) и ЗначениеЗаполнено(Объект.омг_НомерТранзакцииТерминала) Тогда
			Пробить = Истина;	
		КонецЕсли; 	
		НапечататьЧекКлиент(МассивЧеков, Параметры.ИдентификаторУстройства, ВерсияФормата, Пробить);
	КонецЕсли;   
	
КонецПроцедуры   

&НаКлиенте
Процедура НапечататьЧекКлиент(МассивЧеков, ИдентификаторУстройства, ВерсияФормата,Пробить=Ложь)
	
	НомерСекции = 0;
	ЭтаФорма.Доступность = Ложь;
	Контекст = Новый Структура("ИдентификаторУстройства", ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НапечататьЧекКлиентЗавершение", ЭтотОбъект, Контекст);
	
	ПодключенноеОборудование = Новый Структура("Терминал, ФискальныеУстройства");
	ПодключенноеОборудование.ФискальныеУстройства = Новый Массив; 
	ПодключенноеОборудование.ФискальныеУстройства.Добавить(ИдентификаторУстройства);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыОперации.Вставить("Организация", омг_WebKassa.ПолучитьОрганизацию(Объект.Филиал));
	Если Объект.Свойство("Контрагент") Тогда
		ПараметрыОперации.Вставить("Партнер", Объект.Контрагент)
	ИначеЕсли Объект.Свойство("Клиент") Тогда
		ПараметрыОперации.Вставить("Партнер", Объект.Клиент)
	КонецЕсли;
	ПараметрыОперации.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);
	ПараметрыОперации.Вставить("ТорговыйОбъект", Неопределено);
	ПараметрыОперации.Вставить("Пробить", Пробить);
	
	ОткрытьФорму("Обработка.ПечатьЧека.Форма", ПараметрыОперации, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекКлиентЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Если РезультатВыполнения = КодВозвратаДиалога.Отмена ИЛИ РезультатВыполнения = Неопределено Тогда
		ЭтаФорма.Доступность = Истина;
	ИначеЕсли РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Результат Тогда
		ЭтаФорма.Доступность = Истина;
		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		Модифицированность = Истина;
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
		СуммаОплаты = Объект.СуммаДокумента;
		РаботаСДокументамиКлиентСервер.ВывестиЗаголовокСуммаОплатыДокумента(ЭтаФорма);  
		ЭтаФорма.Доступность = Истина;
	Иначе
		ЭтаФорма.Доступность = Истина;
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(Знач НомерСекции, Знач ВерсияФормата, ОписаниеОшибки)
	Возврат Документы.ВозвратПоПлатежнойКарте.СобратьДанныеЧеков(Объект.Ссылка, НомерСекции, ВерсияФормата, ОписаниеОшибки);
КонецФункции            

////////////////////////////////////////////////// 
// ОМГ

&НаСервере
Процедура ОМГ_ПереЗаполнитьОрганизацию()
	Объект.Организация = омг_WebKassa.ПолучитьОрганизацию(Объект.Филиал);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	ОбновитьПредоплату();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредоплату()
	
    Элементы.омг_ВидОплаты.Видимость = ?(Объект.омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата, Истина, Ложь);
	
	Если Объект.омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата
		И Не Объект.ДокументОснование.Пустая()
	Тогда
		СтатусОплаты = омг_Предоплата.ВернутьСтатусОплаты(Объект.ДокументОснование);
		Если ЗначениеЗаполнено(СтатусОплаты) Тогда
			Элементы.омг_СделатьВозврат.Доступность = (СтатусОплаты.Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята);
		Иначе
			Элементы.омг_СделатьВозврат.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// ОМГ    
/////////////////////////////////////////////////
